In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

Question No.2

In [2]:
data = {
    'date': ['2024-01-01', '2024-01-15', '2024-02-01', '2024-02-15', '2024-03-01'],
    'value': [100, 200, 300, 400, 500]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

         date  value
0  2024-01-01    100
1  2024-01-15    200
2  2024-02-01    300
3  2024-02-15    400
4  2024-03-01    500

In [5]:
df['date'] = pd.to_datetime(df['date'])

In [6]:
df.set_index('date', inplace=True)

In [7]:
df

            value
date
2024-01-01    100
2024-01-15    200
2024-02-01    300
2024-02-15    400
2024-03-01    500

In [8]:
df.resample('M').sum()

C:\Users\Hp\AppData\Local\Temp\ipykernel_12216\3731312487.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df.resample('M').sum()

            value
date
2024-01-31    300
2024-02-29    700
2024-03-31    500

Question No.3

In [9]:
dates = pd.date_range(start="2024-01-01", end="2024-12-31", freq='D')

In [10]:
values = np.random.randint(150, 365,366)

In [11]:
dt = pd.DataFrame({'Date': dates, 'Production': values})

In [12]:
dt

          Date  Production
0   2024-01-01         207
1   2024-01-02         192
2   2024-01-03         304
3   2024-01-04         216
4   2024-01-05         228
..         ...         ...
361 2024-12-27         194
362 2024-12-28         357
363 2024-12-29         224
364 2024-12-30         286
365 2024-12-31         218

[366 rows x 2 columns]

In [13]:
dt.set_index('Date', inplace=True)

In [14]:
def custom_function(value):
    return value.max() -value.min()

In [15]:
dt.resample('Q').apply(custom_function)

C:\Users\Hp\AppData\Local\Temp\ipykernel_12216\2086043031.py:1: FutureWarning: 'Q' is deprecated and will be removed in a future version, please use 'QE' instead.
  dt.resample('Q').apply(custom_function)

            Production
Date
2024-03-31         210
2024-06-30         205
2024-09-30         213
2024-12-31         212

Question No.1

In [16]:
from pandas.tseries.offsets import CustomBusinessDay

In [17]:
custom_business_days = CustomBusinessDay(weekmask="Tue Wed Thu Fri Sat")

In [18]:
date=pd.date_range(start="1/1/2024",periods=10,freq=custom_business_days)

In [19]:
date.shape

(10,)

In [20]:
data= np.random.randint(100, 300, 10)

In [21]:
dm = pd.DataFrame({'Date': date, 'Sales': data})

In [22]:
dm

        Date  Sales
0 2024-01-02    237
1 2024-01-03    137
2 2024-01-04    108
3 2024-01-05    204
4 2024-01-06    169
5 2024-01-09    297
6 2024-01-10    106
7 2024-01-11    259
8 2024-01-12    204
9 2024-01-13    290

In [23]:
dm.set_index('Date', inplace=True)

In [24]:
dm.resample('W').sum()

            Sales
Date
2024-01-07    855
2024-01-14   1156

In [25]:
dm.resample('W').sum().rolling(window=3).mean()

            Sales
Date
2024-01-07    NaN
2024-01-14    NaN

Question No.4

In [26]:
date = pd.date_range(start="1/3/2024", periods=30, freq='D')

In [27]:
date

DatetimeIndex(['2024-01-03', '2024-01-04', '2024-01-05', '2024-01-06',
               '2024-01-07', '2024-01-08', '2024-01-09', '2024-01-10',
               '2024-01-11', '2024-01-12', '2024-01-13', '2024-01-14',
               '2024-01-15', '2024-01-16', '2024-01-17', '2024-01-18',
               '2024-01-19', '2024-01-20', '2024-01-21', '2024-01-22',
               '2024-01-23', '2024-01-24', '2024-01-25', '2024-01-26',
               '2024-01-27', '2024-01-28', '2024-01-29', '2024-01-30',
               '2024-01-31', '2024-02-01'],
              dtype='datetime64[ns]', freq='D')

In [28]:
data = np.random.randint(100, 500,30)

In [29]:
data

array([372, 424, 146, 353, 406, 462, 257, 412, 329, 279, 421, 264, 203,
       216, 109, 182, 466, 254, 288, 100, 409, 291, 284, 363, 470, 140,
       340, 449, 269, 370], dtype=int32)

In [30]:
dp = pd.DataFrame({'Date': date, 'Sales': data})

In [31]:
dp['Sales'].rolling(window=7).mean()

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
6     345.714286
7     351.428571
8     337.857143
9     356.857143
10    366.571429
11    346.285714
12    309.285714
13    303.428571
14    260.142857
15    239.142857
16    265.857143
17    242.000000
18    245.428571
19    230.714286
20    258.285714
21    284.285714
22    298.857143
23    284.142857
24    315.000000
25    293.857143
26    328.142857
27    333.857143
28    330.714286
29    343.000000
Name: Sales, dtype: float64

In [32]:
dp['Sales'].rolling(window=7).std()

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
6     109.381160
7     111.996811
8     107.398679
9      74.537303
10     78.287626
11     84.517679
12     82.074589
13     87.698075
14     99.200854
15     97.743591
16    130.513637
17    111.272938
18    112.427543
19    124.948942
20    141.375050
21    125.148864
22    116.922237
23     97.199843
24    118.079070
25    135.660641
26    105.469472
27    111.492045
28    113.198519
29    111.943438
Name: Sales, dtype: float64